/*******************************************************************************
**              广州中科院沈阳自动化研究所分所 Copyright (c)
**                     物联网技术与应用研发中心
**                        IM(2019-2022)
** 作    者：
** 日    期：
** 文件名称：
** 摘    要：

*******************************************************************************/
/*--------------------------------- 头文件 -----------------------------------*/
#include "bsp_Do.h"  

/*-------------------------------- 全局变量 ----------------------------------*/



/*******************************************************************************
** 函数原型：void DO_Bsp_Init(void)
** 函数功能：DO初始化
** 输入参数：无
** 输出参数：无
** 备    注：


*******************************************************************************/
void DO_Bsp_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = { 0 };

	DO0_CLK_ENABLE;

	GPIO_InitStruct.Pin = DO0_PIN;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(DO0_PORT, &GPIO_InitStruct);

}
/*******************************************************************************
*    测试日期           测试人            测试结果          处理结果
*
*******************************************************************************/





