/*******************************************************************************
**              广州中科院沈阳自动化研究所分所 Copyright (c)
**                     物联网技术与应用研发中心
**                        IM(2019-2022)
** 作    者：viggo
** 日    期：
** 文件名称：
** 摘    要：

*******************************************************************************/
#ifndef __APP_MODBUS_H
#define __APP_MODBUS_H

/* ----------------------------------头文件-----------------------------------*/
#include "includes.h"


/*-------------------------------外部调用变量声明-----------------------------*/



/*-------------------------------外部调用函数声明-----------------------------*/
uint16_t MODBUS_RTU_Handle(uint8_t *rxData, uint8_t rxLen, uint8_t *txData);
float RegValToFloat(uint16_t *reg, uint8_t addr);
int32_t RegValToInt32(uint16_t *reg, uint8_t addr);



#endif  //__MODBUS_DATA_H 

/*******************************************************************************
*   版本号        修改日期        修改者        修改内容
*
*******************************************************************************/