/*******************************************************************************
**              广州中科院沈阳自动化研究所分所 Copyright (c)
**                     物联网技术与应用研发中心
**                        IM(2019-2022)
** 作    者：viggo
** 日    期：
** 文件名称：bsp_mcp3208.h
** 摘    要：

*******************************************************************************/
#ifndef __BSP_MCP3208_H
#define __BSP_MCP3208_H
#ifdef __cplusplus
extern "C" {
#endif

	/* Includes ------------------------------------------------------------------*/
#include "main.h"

	void MCP3208_Bsp_Init(s_MCP3208 *mcp3208, s_CONFIG *config);
	void MCP3208_Lanuch(void);

#ifdef __cplusplus
}
#endif
#endif /*__BSP_MCP3208_H */

/*--------------------------------文件结尾------------------------------------*/

