/*******************************************************************************
**              广州中科院沈阳自动化研究所分所 Copyright (c)
**                     物联网技术与应用研发中心
**                        IM(2017-2020)
** 作    者：viggo
** 日    期：
** 文件名称：APP_Task.c
** 摘    要：任务应用接口：显示任务、设置任务、采集任务、通信任务
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "APP_Task.h"





/*******************************************************************************
** 函数原型：void APP_Display_Task_Lanuch(void)
** 函数功能：显示任务入口
** 输入参数：无
** 输出参数：无
** 备    注：

*******************************************************************************/
void APP_Display_Task_Lanuch(void)
{
	LED_Lanuch();
}





/*******************************************************************************
** 函数原型：void APP_Collect_Task_Lanuch(void)
** 函数功能：采集任务处理入口
** 输入参数：无
** 输出参数：无
** 备    注：

*******************************************************************************/
void APP_Collect_Task_Lanuch(void)
{
	MCP3208_Lanuch();
	DI_Lanuch();
}





/*******************************************************************************
** 函数原型：void APP_Set_Task_Lanuch(void)
** 函数功能：设置任务处理接口
** 输入参数：无
** 输出参数：无
** 备    注：

*******************************************************************************/
void APP_Set_Task_Lanuch(void)
{
	WDG_Lanuch();
	RS485_SetUartPara_Lanuch();
}





/*******************************************************************************
** 函数原型：void APP_Communication_Lanuch(void)
** 函数功能：通讯处理接口
** 输入参数：无
** 输出参数：无
** 备    注：

*******************************************************************************/
void APP_Communication_Lanuch(void)
{
	RS485_Lanuch();
	LORA_Lanuch();
}


/*--------------------------------文件结尾------------------------------------*/
