/*******************************************************************************
**              广州中科院沈阳自动化研究所分所 Copyright (c)
**                     物联网技术与应用研发中心
**                        IM(2019-2022)
** 作    者：
** 日    期：
** 文件名称：
** 摘    要：

*******************************************************************************/
/*--------------------------------- 头文件 -----------------------------------*/
#include "APP_Do.h"  

/*-------------------------------- 全局变量 ----------------------------------*/



/*******************************************************************************
** 函数原型：void DO_Reboot_Sta_Set(DO_TypeDef *p)
** 函数功能：DO上电状态设置  
** 输入参数：p   DO结构体首地址
** 输出参数：无
** 备    注：


*******************************************************************************/
void DO_Reboot_Sta_Set(DO_TypeDef *p)
{
	if (p->reboot_sta[0])
		DO0_H;
	else
		DO0_L;

	//if (p->reboot_sta[1])
	//	DO1_OUT_H();
	//else
	//	DO1_OUT_L();

	//if (p->reboot_sta[2])
	//	DO2_OUT_H();
	//else
	//	DO2_OUT_L();

	//if (p->reboot_sta[3])
	//	DO3_OUT_H();
	//else
	//	DO3_OUT_L();

}




/*******************************************************************************
** 函数原型：void DO_Sta_Get(DO_TypeDef *p)
** 函数功能：DO通道状态获取
** 输入参数：p   DO结构体首地址
** 输出参数：无
** 备    注：


*******************************************************************************/
void DO_Sta_Get(DO_TypeDef *p)
{
	p->rt_sta[0] = DO0_READ;
	//p->rt_sta[1] = DO1_OUT_READ();
	//p->rt_sta[2] = DO2_OUT_READ();
	//p->rt_sta[3] = DO3_OUT_READ();
}





/*******************************************************************************
** 函数原型：void DO_Ctrl(DO_TypeDef *p,uint8_t index,uint8_t val)
** 函数功能：DO控制
** 输入参数：p     DO结构体首地址
             index 控制序列
			 val   开关
** 输出参数：无
** 备    注：


*******************************************************************************/
void DO_Ctrl(DO_TypeDef *p,uint8_t index,uint8_t val)
{
	if (index >= 4)
		return;

	switch (index)
	{
		case 0:
			if (val == 0)
				DO0_L;
			else
				DO0_H;
			break;

		//case 1:
		//	if (val == 0)
		//		DO1_OUT_L();
		//	else
		//		DO1_OUT_H();
		//	break;

		//case 2:
		//	if (val == 0)
		//		DO2_OUT_L();
		//	else
		//		DO2_OUT_H();
		//	break;

		//case 3:
		//	if (val == 0)
		//		DO3_OUT_L();
		//	else
		//		DO3_OUT_H();
		//	break;

	}
}

/*******************************************************************************
*    测试日期           测试人            测试结果          处理结果
*
*******************************************************************************/





